#pragma once
#include "Point.h"
#include"windows.h"
#include<queue>
class StartInterface :
	public Point
{
public:
	Tool tool;
	StartInterface();
	~StartInterface();
	void Snake();
	std::queue<Point> Title();
	int time_s = 53;//记录闪烁次数
	int num_point = 53;//记录节点个数
	int Title_xy[53][2] = {//字母组成对应坐标
		{9,19},{9,22},{10,18},{10,20},{10,22},{11,18},{11,21},//S
		{13,18},{13,19},{13,20},{13,21},{13,22},{14,19},{15,20},
		{16,21},{17,18},{17,19},{17,20},{17,21},{17,22},//N
		{23,18},{22,19},{21,20},{20,21},{19,22},{24,19},
		{25,20},{26,21},{27,22},{22,20},{23,20},{24,20},//A
		{29,18},{29,19},{29,20},{29,21},{29,22},{30,20},
		{31,19},{32,18},{31,21},{32,22},//K
		{34,20},{34,19},{34,18},{34,21},{34,22},{35,18},
		{35,20},{35,22},{36,18},{36,20},{36,22}//E
	};
	std::queue<Point>Snake_Point;
	int Snake_xy [13][2]= {
		{0,20},{1,21},{2,22},{3,23},{4,22},{5,21} ,{6,20},
		{7,19},{8,18},{9,17},{10,18},{11,19},{12,20}
	};
	int Point_Status[13] = {1,1,1,0,0,0,0,0,0,1,1,1,1};//0为上升状态，1为下降状态,检测蛇对应节点状态
	void ChangeTitle_xy();//更改标题位置，是在不想在重写一遍那个数组了
	void TheEnd();
};

